tutorials/solution-time/SIPM-SP/threeCavity/noPred/caseC/0/solidL/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 1 -3 -1 0 0 0];

internalField   uniform 1600;//1.2;

boundaryField
{
    right
    {
        type            zeroGradient;
        value           uniform 1600;//1.2;
    }
    top
    {
        type            zeroGradient;
    }
    bottom
    {
        type            zeroGradient;
    }
    left
    {
        type            zeroGradient;
        value           uniform 1600;//1.2;
    }

    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
