tutorials/solution-time/SIPM-SP/threeCavity/noPred/caseC/0/solidR/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 0.5;

boundaryField
{
    right
    {
        type            fixedValue;//zeroGradient;
	value		uniform 1;
    }
    left
    {
        type            solidWallMixedTemperatureCoupled;
        neighbourRegionName cavityR;
        neighbourPatchName right;
        neighbourFieldName T;
        Kappa           k;
        value           uniform 0.5;
    }
    bottom
    {
        type            zeroGradient;
    }
    top
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
